#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов
 #списка, стоящих на нечётной позиции.

#Пример:

#- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

#num=[2, 3, 5, 9, 3]
#sum=0
#for i in range(len(num)):
    #if i%2!=0:
        #sum+=num[i]
#print(sum)







#Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый 
# и последний элемент, второй и предпоследний и т.д.

#Пример:

#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]
#from random import  randint

#num=int(input('Введите числа:'))
#list=num[0]
#list2=num[-1]
#for i in range(num):
    #list.append(randint(0,9))
#for i in range(len(list)):
    #while i<len(list)/2 and num>len(list)/2:
        #num=num-1
        #a=list[i]*list[num]
        #.append(a)
        #i+=1
#print(list)
#print(list2)            




#Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
#  между максимальным и минимальным значением дробной части элементов.

#Пример:

#- [1.1, 1.2, 3.1, 5, 10.01] => 0.19

#lst = [1.1, 1.2, 3.1, 5, 10.01]
#new_lst = [round(i%1,2) for i in lst if i%1!=0]
#print(lst, '=>', max(new_lst) - min(new_lst))




#Напишите программу, которая будет преобразовывать десятичное число в двоичное.

#Пример:

#- 45 -> 101101

#- 3 -> 11
#- 2 -> 10

#n=int(input('Введите число\n'))
#print(bin(n))




exit()
#Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
n=int(input('Введите число:'))
def fibo(n):
    if n>=0:
       idx = range(n+1)
       x = [0,1]
       for k in idx[2:]:
           x.append(x[k-1] + x[k-2]) 
       return x[n]
    else:
       n=-(n-1)
       idx = range(n+1)
       x = [1,0]
       for k in idx[2:]:
           x.append(x[k-2] - x[k-1]) 
       x.reverse()
    return x[0]

for i in range(-13,14):
   print(i,fibo(i))




